In [2]:
import pandas as pd

In [3]:
data= { "first name": ["Ann", "Joe", "Lesy"],
         "Age":  [18,32,25],
         "GENDER":["F","M","F"],
         "salary":[50000, 85000, 20000]
      }

In [4]:
mydf=pd.DataFrame(data)

In [5]:
mydf

  first name  Age GENDER  salary
0        Ann   18      F   50000
1        Joe   32      M   85000
2       Lesy   25      F   20000

In [6]:
mydf.columns

Index(['first name', 'Age', 'GENDER', 'salary'], dtype='object')

#write code that will clean up columns

In [7]:
mydf.rename(columns={'first name': 'first_name', 'Age': 'age'}, inplace=True)

In [8]:
mydf['age']

0    18
1    32
2    25
Name: age, dtype: int64

In [9]:
mydf['first_name']

0     Ann
1     Joe
2    Lesy
Name: first_name, dtype: object

In [10]:
mydf.rename(columns={'GENDER':'gender'}, inplace= True)

In [11]:
mydf['gender']

0    F
1    M
2    F
Name: gender, dtype: object